/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：
* 作    者：lhb Steven
* 完成日期：2016/7/11
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/

#ifndef COM_H
#define COM_H

#include "Type.h"



/**********************************************函数定义***************************************************** 
* 函数名称: void ComInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/6/22
************************************************************************************************************/ 
void ComInit(void);
/**********************************************函数定义***************************************************** 
* 函数名称: u8 FanFandError(u8 num) 
* 输入参数: u8 num 
* 返回参数: u8  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/8/26
************************************************************************************************************/ 
u8 FanFandError(u8 num);

#endif
