/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：
* 作    者：lhb Steven
* 完成日期：2016/9/21
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#ifndef __MENU_H
#define __MENU_H

#include "Type.h"

typedef struct menu{
    u8 time_hour;//时间-小时
    u8 time_minnte;//时间-分钟
    u8 time_time;//开始时间
    u8 time_time_min;//开始时间分钟
    u8 tume_to;//关闭时间
    u8 time_to_min;//结束时间分钟
    u8 time_run;//运行时间
    u8 time_stop;//运行时间
    u8 power;//电源
    u8 menu_set;//设置位
    u8 moto_flash;//电机运行画面
    u8 last_minute;//上一次时间
    u8 run_minute;//以运行时间
    u8 time_out;//超时时间
    u8 level;//油量检测
    u16 conti_run_time;//持续运行时间
    u8 conti_run_time_min;//持续运行时间
    u8 wifi_bit;//wifi连接状态
    u8 uptime;
}menu;

/**********************************************函数定义***************************************************** 
* 函数名称: void MenuInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/21
************************************************************************************************************/ 
void MenuInit(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuBut(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/21
************************************************************************************************************/ 
void MenuBut(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuUpdata(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/22
************************************************************************************************************/ 
void MenuUpdata(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuGetPower(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/23
************************************************************************************************************/ 
u8 MenuGetPower(void);
/**********************************************函数定义***************************************************** 
* 函数名称: u8 MenuGetLevel(void) 
* 输入参数: void 
* 返回参数: u8  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/23
************************************************************************************************************/ 
u8 MenuGetLevel(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuSetPower(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/23
************************************************************************************************************/ 
void MenuSetPower(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuSetWork(u8 start,u8 end,u8 run,u8 stop) 
* 输入参数: u8 start,u8 end,u8 run,u8 stop 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/23
************************************************************************************************************/ 
void MenuSetWork(u8 start,u8 end,u8 run,u8 stop,u8 start_min,u8 end_min);
/**********************************************函数定义***************************************************** 
* 函数名称: u8 MenuGetWorkTime(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: u8  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/26
************************************************************************************************************/ 
u8 MenuGetWorkTime(u8 cmd);
/**********************************************函数定义***************************************************** 
* 函数名称: u16 MenuGetRunTime(void) 
* 输入参数: void 
* 返回参数: u16  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/27
************************************************************************************************************/ 
u16 MenuGetRunTime(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void MenuWifiSer(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/9/29
************************************************************************************************************/ 
void MenuWifiSer(void);


#endif




